[
    [
        "Now works on your dashboard, like, and search pages.",
        "Improved visual styling.",
        "Improved options page.",
        "General fixes and improvements."
    ],
    [
        "A whole new set of icons.",
        "Added a button to the options page in the address bar."
    ],
    [
        "You can now download images straight from someone&rsquo;s archive."
    ],
    [
        "Completely refactored the code to be more extensible and maintainable in the future.",
        "Settings now sync across multiple options pages.",
        "Files are now downloaded using the native chrome.downloads API.",
        "Improved detection of infinite scrolling."
    ],
    [
        "General fixes and improvements."
    ],
    [
        "You can now specify custom download locations.",
        "Set a default download location where to save all your images.",
        "Your locations and confirmation settings now sync across your Google account.",
        "General fixes and improvements."
    ],
    [
        "You can now download images from slideshows on Tumblelogs. (That is, anywhere where you can bring up a full image view.)",
        "Added support for SSL-enabled dashboards.",
        "Redesigned the options page to resemble that of Tumblr&rsquo;s."
    ],
    [
        "External links that don&rsquo;t lead to images will now trigger a confirmation pop-up.",
        "Lots of code adjustments and bug fixes."
    ],
    [
        "Expand inline images in posts to bring up the download button.",
        "Downloaded images now show a small tick even when you&rsquo;re not hovering over them. You can disable this in the options."
    ],
    [
        "Fixed a bug where images without a MIME type would not download correctly."
    ],
    [
        "Fixed a bug where infinite scrolling was not being detected properly."
    ],
    [
        "Added the ability to disable download locations dropdown in the options."
    ],
    [
        "New, pretty dialog boxes instead of the normal Chrome pop-ups.",
        "Fixed a bug where the download button would be visible above the editing view (such as when reblogging).",
        "Lots of code and performance improvements and other bug fixes."
    ],
    [
        "Improved the options page and the general design."
    ],
    [
        "You can now quickly access options from the icon in the address bar on Tumblr pages.",
        "Have experience translating? Check out the options page for more info!"
    ],
    [
        "General code optimizations and improvements.",
        "Downloading to a directory now works in archives.",
        "Revamped the download button styling in archives."
    ],
    [
        "Performance improvements.",
        "Bug fixes."
    ],
    [
        "Added the download button to the single image view page.",
        "General fixes and improvements."
    ],
    [
        "Improvements to the locations options. You can now always specify a default location."
    ],
    [
        "New icon.",
        "Improved options page.",
        "Option to disable Google Analytics.",
        "Improved high-res image detection."
    ],
    [
        "All the custom directories an image has been downloaded to will now also have a tick next to them.",
        "Bug fixes."
    ],
    [
        "Hold Ctrl to forget a downloaded image.",
        "Hold Alt to open the image in the file browser.",
        "Support for full images inside text posts."
    ],
    [
        "Hold Shift to download all images in a post.",
        "Improvements to the download confirmation dialog."
    ],
    [
        "Improved and much more useful dialog for revealing images that were downloaded more than once."
    ],
    [
        "Greatly improved the reliability of the database and the downloading of images.",
        "Fixed revealing images from the archive page.",
        "Bug fixes."
    ],
    [
        "Lots of bug fixes and general improvements."
    ]
]
